# encoding: utf-8

attr_value_title = {
    u'author': {
        'title': {
            u'ru': u'Автор'
        },
    },
    #########################################################
    u'author_name_corporate': {
        'title': {
            u'ru': u'Коллектив'
        },
    },
    #########################################################
    u'autograph': {
        'title': {
            u'ru': u'Автограф'
        },
    },
    #########################################################
    u'bib_level': {
        'title': {
            u'ru': u'Библиографический уровень'
        },
    },
    #########################################################
    u'catalog': {
        'title': {
            u'ru': u'Каталог'
        },
        'values': {
            u'books': {
                u'ru': u'Книги',
            },
            u'dep': {
                u'ru': u'Фонд редких и ценных книг',
            },
            u'ininf': {
                u'ru': u'Отчеты банков и международных финансовых организаций',
            },
            u'jour': {
                u'ru': u'Журналы и статьи',
            },
            u'hud': {
                u'ru': u'Художественная литература',
            },
            u'mag_r': {
                u'ru': u'Журналы на русск. языке',
            },
            u'mag_f': {
                u'ru': u'Журналы на иностр. языке',
            },
            u'nd': {
                u'ru': u'Неопубликованные документы',
            },
            u'rsk': {
                u'ru': u'Каталог старых книг',
            },
            u'scann': {
                u'ru': u'Сканированные документы',
            },
            u'teka': {
                u'ru': u'Фототека',
            },
            u'video': {
                u'ru': u'Видео',
            },
            u'sic': {
                u'ru': u'Обзоры публикаций',
            },

        }
    },
    #########################################################
    u'code_language': {
        'title': {
            u'ru': u'Язык'
        },
        'values': {
            u'rus': {
                u'ru': u'Русский',
            },
            u'eng': {
                u'ru': u'Английски',
            },
            u'ger': {
                u'ru': u'Немецкий',
            },
            u'fre': {
                u'ru': u'Французский',
            },
            u'ita': {
                u'ru': u'Итальянский',
            },
            u'dan': {
                u'ru': u'Датский',
            },
            u'ukr': {
                u'ru': u'Украинский',
            },
            u'spa': {
                u'ru': u'Испанский',
            },
            u'chi': {
                u'ru': u'Китайский',
            },
            u'ara': {
                u'ru': u'Арабский',
            },
            u'vie': {
                u'ru': u'Вьетнамский',
            },
            u'fin': {
                u'ru': u'Финский',
            },
            u'swe': {
                u'ru': u'Швейцарский',
            },
            u'dut': {
                u'ru': u'Голландский',
            },
            u'lat': {
                u'ru': u'Латинский',
            },
            u'nor': {
                u'ru': u'Норвежский',
            },
            u'jpn': {
                u'ru': u'Японский',
            },
            u'est': {
                u'ru': u'Эстонский',
            },
            u'pol': {
                u'ru': u'Польский',
            },
            u'mul': {
                u'ru': u'Многоязычный',
            },
            u'rum': {
                u'ru': u'Румынский',
            },
            u'per': {
                u'ru': u'Персидский',
            },
            u'bul': {
                u'ru': u'Болгарский',
            },
            u'cze': {
                u'ru': u'Чешский',
            },
            u'hun': {
                u'ru': u'Венгерский',
            },
            u'por': {
                u'ru': u'Португальский',
            },
            u'scc': {
                u'ru': u'Сербский',
            },
            u'bel': {
                u'ru': u'Белорусский',
            },
            u'hin': {
                u'ru': u'Хинди',
            },
            u'gre': {
                u'ru': u'Греческий',
            },
            u'tue': {
                u'ru': u'Турецкий',
            },
            u'urd': {
                u'ru': u'Урду',
            },
            u'kor': {
                u'ru': u'Корейский',
            },
            u'pus': {
                u'ru': u'Пушту',
            },
            u'aze': {
                u'ru': u'Азербайджанский',
            },
            u'heb': {
                u'ru': u'Иврит',
            },
            u'mon': {
                u'ru': u'Монгольский',
            },
            u'lav': {
                u'ru': u'Латвийский',
            },
            u'tuk': {
                u'ru': u'Туркменский',
            },
            u'ru': {
                u'ru': u'Русский',
            },
            u'kaz': {
                u'ru': u'Иврит',
            }
        }
    },
    u'content_type': {
        'title': {
            u'ru': u'Тип контента'
        },
        'values': {
            u'a': {
                u'ru': u'библиографическое издание',
            },
            u'b': {
                u'ru': u'каталог',
            },
            u'c': {
                u'ru': u'указатель',
            },
            u'd': {
                u'ru': u'реферат',
            },
            u'e': {
                u'ru': u'словарь',
            },
            u'f': {
                u'ru': u'энциклопедия',
            },
            u'g': {
                u'ru': u'справочное издание',
            },
            u'h': {
                u'ru': u'описание проекта',
            },
            u'i': {
                u'ru': u'статистические данные',
            },
            u'j': {
                u'ru': u'учебник',
            },
            u'k': {
                u'ru': u'патент',
            },
            u'l': {
                u'ru': u'стандарт',
            },
            u'm': {
                u'ru': u'диссертация',
            },
            u'n': {
                u'ru': u'законы',
            },
            u'o': {
                u'ru': u'словарь',
            },
            u'p': {
                u'ru': u'технический отчет',
            },
            u'q': {
                u'ru': u'экзаменационный лист',
            },
            u'r': {
                u'ru': u'литературный обзор/рецензия',
            },
            u's': {
                u'ru': u'договоры',
            },
            u't': {
                u'ru': u'карикатуры или комиксы',
            },
            u'w': {
                u'ru': u'религиозные тексты',
            },
            u'z': {
                u'ru': u'другое',
            },
        }
    },
    #########################################################
    u'date_of_publication': {
        'title': {
            u'ru': u'Год публикации'
        }
    },
    #########################################################
    u'date_of_publication_of_original': {
        'title': {
            u'ru': u'Год издания оригинала'
        }
    },
    #########################################################
    u'date_time_added_to_db': {
        'title': {
            u'ru': u'Дата ввода в БД'
        }
    },
    #########################################################
    u'date_time_of_income': {
        'title': {
            u'ru': u'Дата поступления'
        }
    },
    u'first_letter': {
        'title': {
            u'ru': u'A to Z'
        }
    },
    #########################################################
    u'full_text': {
        'title': {
            u'ru': u'Полный текст'
        }
    },
    #########################################################
    u'has_full_text_url': {
        'title': {
            u'ru': u'Наличие полного текста'
        },
        'values': {
            u'1': {
                u'ru': u'да',
            },
            u'0': {
                u'ru': u'нет',
            },
        }
    },
    #########################################################
    u'host_item': {
        'title': {
            u'ru': u'Источник статьи'
        }
    },
    #########################################################
    u'isbn': {
        'title': {
            u'ru': u'ISBN'
        }
    },
    #########################################################
    u'issn': {
        'title': {
            u'ru': u'ISSN'
        }
    },
    #########################################################
    u'literary_incipit': {
        'title': {
            u'ru': u'Инцип'
        }
    },
    'material_type': {
        'title': {
            u'ru': u'Материалы'
        },
        'values': {
            u'monography': {
                u'ru': u'Монографии',
            },
            u'journal_paper': {
                u'ru': u'Журналы, газеты',
            },
            u'issues': {
                u'ru': u'Выпуски',
            },
            u'articles_reports': {
                u'ru': u'Cтатьи, доклады',
            },
            u'collections': {
                u'ru': u'Подборки',
            },
            u'integrity': {
                u'ru': u'Интегрируемые ресурсы',
            },
            u'texts': {
                u'ru': u'Тексты',
            },
            u'musical_scores': {
                u'ru': u'Музыкальные партитуры',
            },
            u'maps': {
                u'ru': u'Карты',
            },
            u'video': {
                u'ru': u'Видео',
            },
            u'sound_records': {
                u'ru': u'Звукозаписи',
            },
            u'graphics': {
                u'ru': u'Графика',
            },
            u'e_resources': {
                u'ru': u'Электронные ресурсы',
            },
            u'dissertation_abstracts': {
                u'ru': u'Диссертации, рефераты',
            },
            u'textbook': {
                u'ru': u'Учебники',
            },
            u'patents': {
                u'ru': u'Патенты',
            },
            u'standarts': {
                u'ru': u'Стандарты',
            },
            u'legislative_acts': {
                u'ru': u'Законодательные акты',
            },
            u'technical_reports': {
                u'ru': u'Технические отчеты',
            },
            u'references': {
                u'ru': u'Справочники',
            },
            u'dictionaries': {
                u'ru': u'Словари',
            },
            u'encyclopedias': {
                u'ru': u'Энциклопедии',
            },
        }
    },
    #########################################################
    u'org_creator': {
        'title': {
            u'ru': u'Организация создатель'
        }
    },
    #########################################################
    u'owner': {
        'title': {
            u'ru': u'Держатель'
        }
    },
    #########################################################
    u'place_publication': {
        'title': {
            u'ru': u'Место публикации'
        }
    },
    #########################################################
    u'publisher': {
        'title': {
            u'ru': u'Издательство'
        }
    },
    #########################################################
    u'query': {
        'title': {
            u'ru': u'Поисковое выражение'
        }
    },
    #########################################################
    u'score': {
        'title': {
            u'ru': u'Релевантность'
        }
    },
    #########################################################
    u'subject': {
        'title': {
            u'ru': u'Тематика'
        }
    },
    #########################################################
    u'subject_heading': {
        'title': {
            u'ru': u'Тематика'
        }
    },
    #########################################################
    u'subject_name_geographical': {
        'title': {
            u'ru': u'География'
        }
    },
    #########################################################
    u'subject_name_personal': {
        'title': {
            u'ru': u'Персоналия'
        }
    },
    #########################################################
    u'subject_subheading': {
        'title': {
            u'ru': u'Подрубрика'
        }
    },
    #########################################################
    u'subject_keywords': {
        'title': {
            u'ru': u'Ключевые слова'
        }
    },
    #########################################################
    u'title': {
        'title': {
            u'ru': u'Заглавие'
        }
    },
    #########################################################
    u'title_source': {
        'title': {
            u'ru': u'Заглавие источника'
        }
    },
    #########################################################
    u'title_series': {
        'title': {
            u'ru': u'Заглавие серии'
        }
    },
    #########################################################
    u'type': {
        'title': {
            u'ru': u'Тип БД'
        }
    },
    #########################################################
    u'all': {
        'title': {
            u'ru': u'Везде'
        }
    },
    #########################################################
    u'bbk': {
        'title': {
            u'ru': u'ББК'
        }
    },
    #########################################################
    u'udc': {
        'title': {
            u'ru': u'УДК'
        }
    },
    #########################################################
    u'grnti': {
        'title': {
            u'ru': u'ГРНТИ'
        }
    },
    #########################################################
    u'udk': {
        'title': {
            u'ru': u'УДК'
        }
    },
    #########################################################
    u'url_source': {
        'title': {
            u'ru': u'Источник'
        },
        'values': {
            u'elib': {
                u'ru': u'Электронная библиотека',
            },
            u'inner': {
                u'ru': u'Внутренний',
            },
            u'external': {
                u'ru': u'Внешний',
            },
        }
    },
    #########################################################
    u'system_source_id': {
        'title': {
            u'ru': u'Базы'
        },
        'values': {
            u'spstu': {
                u'ru': u'ФБ СПбГПУ',
            },
            u'mars': {
                u'ru': u'МАРС',
            }
        }
    },
    u'collection': {
        'title': {
            u'ru': u'Электронная библиотека'
        },
        # 'values': {
        #     u'Уральская область.Уральская электронная библиотека': {
        #         u'ru': u'Уральская область',
        #     }
        # }
    },

}


def get_attr_title(attr, lang=u'ru'):
    try:
        return attr_value_title[attr.lower()]['title'][lang]
    except KeyError:
        pass

    parts = attr.split(u'_')
    try:
        return attr_value_title[u'_'.join(parts[:-1])]['title'][lang]
    except KeyError:
        pass
    return attr


def get_attr_value_title(attr, value, lang=u'ru'):

    try:
        return attr_value_title[attr.lower()]['values'][value.lower()][lang]
    except KeyError:
        pass

    parts = attr.split(u'_')
    try:
        return attr_value_title[u'_'.join(parts[:-1])]['values'][value.lower()][lang]
    except KeyError:
        pass
    return value